import{_ as p,c as r,o as n,a as e}from"./app.0c5fc1fa.js";const u=JSON.parse('{"title":"书摘","description":"","frontmatter":{"title":"书摘","author":"Zack Zheng","date":"2024/10/25 12:56 - 不慌不忙：做一个内核稳定的人","tags":["社科"]},"headers":[],"relativePath":"books/socialSciences/不慌不忙：做一个内核稳定的人/10月25日书摘.md","lastUpdated":1731294975000}'),t={name:"books/socialSciences/不慌不忙：做一个内核稳定的人/10月25日书摘.md"},h=e(`<p>作者： 林桂枝</p><p>&quot;必要做&quot;必须走在前面，”想要做“才有可能实现。<br> 做好你“必要做”的，才有可能做你“想要做”的。</p><hr><p>效率是没有多余动作</p><hr><p>所罗门王有一枚戒指，上面刻着：一切都会过去。人世间的事物，无论时间长短，总是要完结的。</p><hr><p>婚姻中的混账问题往往源于时间一长，双方会怠慢对方。两个人不再花时间与精力让自己饱满充盈，少有给对方慰藉，为伴侣打气。当二人都不给迂回的空间让各自活得自在，久而久之，怨闷与不满自然接踵而至。解决混账，最好的办法是干脆不结婚，或者婚后以恋爱的心态相处。</p><hr><p>弄清楚要说的是什么，跟你如何去说同样重要，两者更有先后次序之分。</p><hr><p>忠于预设的一切，只能接受已有的预装。能否用行动冲破既定的轨道，自行下载新设置，取决于你。</p><hr><p>如果你今年三四十岁，不知不觉之间，你已经步入人生的下半场。<br> 下半场该怎样安排，值得停下来好好思考一下。</p><hr><p>不要回望过去，也不必寄望将来，集中精力做好眼前的每一件事。过去已经消逝，未来在你的处境之外。一天天过去是一年，一年年过去是一生。今天你怎样过，这一生你就怎样过了。</p><hr><p>给女儿的信</p><p>亲爱的JJ：</p><pre><code>每个星期天，我们回家都经过这段高速公路。     
你看，这路上的汽车像不像一座又一座孤岛，在城市的汪洋中漂浮。     

眼前的这些孤岛在公路上一个挨着一个，   
左右相邻，前后相间，虽成群结队，但始终咫尺天涯。  
漂浮的孤岛无法逾越它们之间的罅隙，   
没有一座孤岛与另外的孤岛不存在距离。   

就像我们俩，虽然有着亲密的血缘关系，   
却如两座独立的孤岛，茕茕孑立。         

我们各自存在于自身的孤岛上，  
脑海中充满了难以抵御的念头，  
情绪跌宕无常。      
从朝起到日落，我们跟自己无休无止地对话：
回忆着从未发生的过去，臆想着千真万确的未来。      
我们在各自的孤岛上编织自己的故事。
每个人都在述说孤岛上的经历，就像我们一起读过的《鲁滨逊漂流记》。     

人们到酒吧聊天，谈情说爱，结婚生子，
总期望将自己的故事分享给别人，奢望别人能进入自己的内心。        
然而，没有一个人能到达另一个孤岛。   
因为我们都被“自我”囚禁在孤岛上，没有人能离开，
漂浮的孤岛只管自顾自漂浮。         

我们能做的，是竭尽全力写好自己的故事，   
让它不至于语焉不详，陈词滥调。      

JJ，写好你的故事，我在这孤岛上等待着，   
等待风中传来你的朗读声。   
只要你用心写，只要你真诚读，我永远倾听。    
</code></pre><hr><p>自然不理会你有多么爱惜这些花花草草。自然不施舍、不眷顾、不怜悯。飓风、海啸、火山爆发，与吹在你脸上的风一样，说来就来，想走就走。</p><hr><p>过了今天晚上，不会有太多的人想起这月亮曾经那么亮、那么发光，不会想起自己曾激动地连续快拍，想将月亮留下来。时间一长，一切只会朦朦胧胧，像个虚构的故事。</p><hr><p>只要双方朝着相反的方向前进，就有机会遇上，这是我行走在这段公路经年累月悟出的道理，对此我深信不疑。A从东向西走，B从东往西行，就像你和我，生的往死里走，死的往生里去，我们从相反的方向前进，必会再度相逢。</p><hr><p>物质上的纷繁变化，只是在表达现代生活乏味的单一性。</p><hr><p>吃龙虾是人生的奇耻大辱，这个观念持续到18世纪末。到19世纪初，人们把龙虾制成猫粮罐头。一罐龙虾猫粮约售0.11美元，相比每罐0.53美元的黄豆罐头，龙虾真的太丢人。那些不幸的猫只能躲到墙角低着头偷偷吃，怕被老鼠看见，一辈子丢了猫脸，翻不了猫身。</p><p>我们认为事物是什么，事物就会变成什么。龙虾是在地球上生活了一亿年以上的古老海洋生物。一亿多年来，龙虾自身没有发生什么变化。</p><p>完美的福楼拜说过：“没有真相，只有感知。“</p><hr><p>少日曾题菊枕诗，蠹编残稿锁蛛丝。<br> 人间万事消磨尽，只有清香似旧时。</p><pre><code>        -- 陆游   
</code></pre><hr><p>钱在我们的手中只是过了一下手。从来，我们不知道它自哪里来，将往何处去。</p><hr><p>一段爱情对两个人来说往往是两个迥然不同的故事，我们只会视自己的看法为真相，按照设想的版本续写，直到剧终。</p><hr><p>哲学家叔本华告诉我们，这就类似水对自己说：“我可以掀起巨浪，我可以冲下丘陵，我可以喷涌而下，激情冲上半空，我蒸发，我消失。可是，现在我决定不做以上任何一件事，而依旧是门前镜湖水，保持宁静澄明。”</p><p>我们到底可以决定什么？我们的意志、我们的选择是否由我们主宰？我们自以为经过自己决定的一切是否只是一个接着一个自欺欺人的笑话？水没有意识到要蒸发便需要高温，要成为巨浪便需要飓风的降临，要冲上半空更要安上喷水池的装置。只记得自己曾经做过的一些事，便自以为现在就能做到，最后，仅能将自己保留为镜湖水归功于自己的抉择。</p><hr><p>无法挽回的事情就像泼出去的水，过去的就让它过去吧。 --《麦克白》</p><hr><p>我中学同学的弟弟因为儿时姑姑多次不把饼干给他而给了两个姐姐，成为一个经常叹气的人。长大成人后，他几十年如一日，总是爱无缘无故地叹气。<br> 这件真实的事情，我也是几十年如一日地挥之不去，时不时会想起这位叹气的小弟，觉得难过。为什么我们会这样，对负面的事物如此放不下？</p><hr><p>生活是意见。我们对一本书、一顿饭、一只狗、一句话，对身边的一切人与事提出意见。我们提出意见后，人们又对我们的意见指出自己的意见。当人们把自己对意见的意见分享给别人，别人又会对这些意见衍生出另一番意见。</p><p>今天早上起来，外面天色阴霾，我便对自己提出“今天是个鬼天气”的意见。这意见论及天气，却与天气无关。天气依然故我，不会因为我的意见而转变。我们的意见改变不了事物的本质，犹如我们改变不了天要放晴还是要下雨。</p><p>意见与事物毫无关系。</p><p>面对意见，唯一的出路是改变自己对意见的反应：不随便对事物提出负面意见；不对别人的意见妄加无谓的意见；别人的意见使你感到难受，请告诉对方；对方坚持自己的意见，请任其自然。假如自己的意见让自己感到不快，请修改；改不了，请放下。</p><p>意见是表象，一旦提出，旋即消失。宇宙是流变，万物在改变。我们唯一可以做的，是做流水中那只纹丝不动的手，在激流中敏锐观察，接受一切的变化，明白在生之前和死之后是时间的无限深渊，一切如流水般消逝，不舍昼夜。</p><p>既然我轻若微尘，转瞬即逝，我的意见，又何足挂齿。</p><hr><p>古希腊哲学家德谟克利特说：如果你想快乐，那就少做一点事情。</p><hr><p>既然名字不可以被定义，在遥远的高原与一群没有名字的人在一起，应是件自然又本真的事。我从一群藏族妇女身边走过，她们朝我招手，把半张毡子让出来，叫我趴下。我趴下来与她们一起背负青天，俯看绿草，大家交换了一个笑容。</p><p>趴着趴着，我就跟着她们换了换姿势，一块儿坐起来。假如命运允许我随心所欲地生活，我愿意整天躺在眼前这片广袤无垠的高原上。</p><p>我的名字叫什么，你叫什么；我做过什么，你的工作是什么。名字与身份这些平素令人感到重要的东西，在白云飘过的长空，连忘记都不值一提。</p><p>生命与生命相遇，以至你我相交相知，不需要名字，何况其他。</p><hr><p>对于时间，我有许多问题。</p><p>为什么我可以记得过去，而没法回忆将来？为什么出生的时候是个婴儿，离世之时我便老去？为什么小时候的暑假漫长得像一个世纪，长大后一年过得比一年快？</p><p>昨夜无事乱翻书，看到一位哲学家这样说：假如你是个一岁的婴儿，一年是你百分之百的人生；当你两岁，一年等于你的半生；三岁，一年便是你三分之一的人生。</p><p>假如我们在度过每一刻的时候能把自己过去的时光算进去，时间会呈现出不一样的状态。</p><p>当你到了三十岁，一年只等同你3.33%的人生；四十岁，一年占你2.5%的人生。假如你高寿到一百岁，一年只是你百分之一的人生。</p><p>换句话说，假如你今年三十岁，你过的这一年等于你一岁时的十二天；四十岁，你过的一年是你一岁时的九天。年头越增加，日子便越短，每添一年时日更短，两者的关系此消彼长。</p><p>也许我们真的没办法理解时间，然而，当我们感到一年过得比一年快的时候，便意味着死亡与我们越来越靠近。也许，只有在步入永恒的一刻，时间之谜才终于有可能被破解。然而，知道谜底也是枉然的，犹如比赛的结果对一个提前退场的运动员毫无意义。</p><hr><p>法国哲学家布里丹曾推论：一头完全理性的驴处于两堆等量等质的干草中间，可能会挨饿，因为这头驴不能对吃哪一堆干草做出理性的决定，结果只能饿死。</p><hr><p>感到自己不足，自然会觉得别人认为你不堪。怎样看是别人的事，关键是自己如何看待自己。</p><p>世界上没有人可以决定你的存在价值，唯有你。</p><hr><p>罪行时时发生，理性常常缺失。</p><hr><p>柏拉图说：“人是没有羽毛、两脚直立的动物。“一天，酒桶哲学家第欧根尼提了一只拔了毛的鸡闯进柏拉图的课堂，指着鸡对同学们说：“这就是你们的老师，柏拉图先生。”</p><hr>`,78),o=[h];function _(a,c,s,d,i,l){return n(),r("div",null,o)}const f=p(t,[["render",_]]);export{u as __pageData,f as default};
